app/Http/Controllers/GuestController.php

    public function voters_registration(PointOfInterestService $service)
    {
        $locations = $service->fetchPointsOfInterestByLocations(1);

        return Inertia::render("Welcome", [
            "faqs" => FrequentlyAskedQuestion::all(),
            "information" => InformationSnippet::all(),
            "locations" => $locations,
        ]);
---
select * from "frequently_asked_questions"