app/Http/Controllers/GuestController.php

select * from "districts" where "districts"."id" in (1, 2, 3, 4, 5, 6)
select * from "information_snippets"
select * from "districts"
select * from "point_of_interests" where "point_of_interest_type_id" = 1
---
    public function voters_registration()
    {
        return Inertia::render("Welcome", [
            "faqs" => FrequentlyAskedQuestion::all(),
            "information" => InformationSnippet::all(),
            "districts" => District::all(),
            "locations" => Location::all(),
            "locationTree" => Location::getTree(),
            "registrationSites" => PointOfInterest::where(
                "point_of_interest_type_id",
                "=",
                1
            )
                ->with("location")
                ->get(),
        ]);