app/Models/PointOfInterest.php

    public function getTypeAttribute(){
        return DB::table('point_of_interest_types')->find($this->point_of_interest_type_id)->type;
---
select * from "point_of_interest_types" where "id" = 1 limit 1